In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    {'Nome  ': ["Arthur", "Júlia", "Paulo"],
     '  aGe  ': [26, 1, 30]}
)

In [3]:
df

   Nome      aGe
0  Arthur       26
1   Júlia        1
2   Paulo       30

# Transformar todas colunas

In [4]:
df.columns = df.columns.str.lower() # upper() para maiúsculo
df.columns = df.columns.str.strip()

In [5]:
df.columns

Index(['nome', 'age'], dtype='object')

In [6]:
coluna_renomeada = {
    "age": "idade"
}

df.rename(columns=coluna_renomeada, inplace=True)

In [7]:
df

     nome  idade
0  Arthur     26
1   Júlia      1
2   Paulo     30